keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_MCU_P1/Mcu/Mcu.h
/******************************************************************************
**                                                                           **
** Copyright (C) Infineon Technologies (2013)                                **
**                                                                           **
** All rights reserved.                                                      **
**                                                                           **
** This document contains proprietary information belonging to Infineon      **
** Technologies. Passing on and copying of this document, and communication  **
** of its contents is not permitted without prior written authorization.     **
**                                                                           **
*******************************************************************************
**                                                                           **
**  $FILENAME   : Mcu.h $                                                    **
**                                                                           **
**  $CC VERSION : \main\53 $                                                 **
**                                                                           **
**  $DATE       : 2014-01-07 $                                               **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **
**  VENDOR      : Infineon Technologies                                      **
**                                                                           **
**  DESCRIPTION : This file contains functionality of MCU driver.            **
**                                                                           **
**  MAY BE CHANGED BY USER [yes/no]: No                                      **
**                                                                           **
******************************************************************************/
/*  TRACEABILITY : [cover parentID=DS_AS_MCU152,
                   SAS_AS_MCU108_MCU211_MCU215_MCU109_MCU111_MCU213,
                   DS_AS40X_MCU201]                           
                   [/cover]                                                   */

#ifndef MCU_H
#define MCU_H

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/

  /* Inclusion of Platform_Types.h and Compiler.h */
#include "Std_Types.h"
#include "Mcal.h"

  /* Inclusion of controller sfr file */
#include "IfxScu_reg.h"

  /* Post_Build configuration parameters for MCU */
  /* MCU108 :Inclusion of Mcu_Cfg.h file */
#include "Mcu_Cfg.h"

#if (MCU_GTM_USED == STD_ON)
/* Inclusion of Gtm.h file */
 #include "Gtm.h"
#endif
#if ((MCU_E_CLOCK_FAILURE_DEM_REPORT == MCU_ENABLE_DEM_REPORT)||\
     (MCU_E_ERAY_TIMEOUT_DEM_REPORT == MCU_ENABLE_DEM_REPORT)||\
     (MCU_E_OSC_FAILURE_DEM_REPORT == MCU_ENABLE_DEM_REPORT))
#include "Dem.h"
#endif
/** Traceability : [cover parentID=DS_AS_MCU163]*/

#if ( MCU_DEV_ERROR_DETECT == STD_ON)
/* Import of DET functionality */
#include "Det.h"
#endif  /* End Of MCU_DEV_ERROR_DETECT */
/*[/cover]   */

/*******************************************************************************
**                      Global Macro Definitions                              **
*******************************************************************************/
/* Maximum timeout value to acquire the Safety endinit */
#define MCU_SAFETY_ENDINT_TIMEOUT ((uint32)150000U)

  /* [cover parentID=DS_AS_MCU112, DS_AS_MCU012] */
  /* Development error values */
  /* [/cover]  */

#if (MCU_DEV_ERROR_DETECT == STD_ON) || ( MCU_SAFETY_ENABLE == STD_ON )
  /* MCU012, MCU015: Error Value Classification & naming convention */
  /* MCU112 : Development errors are of type uint8 */

  /* MCU018 : MCU_E_PARAM_CONFIG */
  /* API Service called with wrong parameter */
#define MCU_E_PARAM_CONFIG        ((uint8)(10))

  /* MCU019 : MCU_E_PARAM_CLOCK */
  /* API Service called with invalid clocksetting */
#define MCU_E_PARAM_CLOCK         ((uint8)(11))

  /*MCU020 : MCU_E_PARAM_MODE */
  /* API Service called with invalid mode */
#define MCU_E_PARAM_MODE          ((uint8)(12))

  /* MCU021 : MCU_E_PARAM_RAMSECTION */
  /*API Service called with invalid ramsection */
#define MCU_E_PARAM_RAMSECTION    ((uint8)(13))

  /* MCU122 : MCU_E_PLL_NOT_LOCKED */
  /* If the status of the PLL is detected as not locked when
   Mcu_DistributePllClock() then this DET is reported */
#define MCU_E_PLL_NOT_LOCKED      ((uint8)(14))

  /* MCU125 : MCU_E_UNINIT */
  /* The service Mcu_Init() shall be called first before calling
    any other MCU services */
#define MCU_E_UNINIT              ((uint8)(15))

  /* MCU012 : MCU_E_PARAM_POINTER */
  /* When the passed pointer is NULL_PTR */
#define MCU_E_PARAM_POINTER       ((uint8)(0x10U))


/* Service ID for Mcu_Init */
#define MCU_SID_INIT                 ((uint8)0)
/* Service ID for Mcu_InitRamSection */
#define MCU_SID_INITRAMSECTION       ((uint8)1)
/* Service ID for Mcu_InitClock */
#define MCU_SID_INITCLOCK            ((uint8)2)
/* Service ID for Mcu_DistributePllClock */
#define MCU_SID_DISTRIBUTEPLLCLOCK   ((uint8)3)
/* Service ID for Mcu_GetPllStatus */
#define MCU_SID_GETPLLSTATUS         ((uint8)4)
/* Service ID for Mcu_GetResetReason */
#define MCU_SID_GETRESETREASON       ((uint8)5)
/* Service ID for Mcu_GetResetRawValue */
#define MCU_SID_GETRESETRAWVALUE     ((uint8)6)
/* Service ID for Mcu_PerformReset*/
#define MCU_SID_PERFORMRESET         ((uint8)7)
/* Service ID for Mcu_SetMode */
#define MCU_SID_SETMODE              ((uint8)8)
/* Service ID for  Mcu_GetVersionInfo  */
#define MCU_SID_GETVERSIONINFO       ((uint8)9)
/* Service ID for  Mcu_GetRamState  */
#define MCU_SID_GETRAMSTATE          ((uint8)10)

