keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_MCU_P1/Mcu/Mcu.h
/* Return value when DET error found*/
#define MCU_ERR_FOUND                ((uint32)1)
/* return value when DET error is not found*/
#define MCU_ERR_NOT_FOUND            ((uint32)0)

#endif
/* End of (MCU_DEV_ERROR_DETECT == STD_ON) */

/* Reset Status types of MCU needed for internal use in a raw form */
/* ESR0 reset */
#define MCU_RAW_ESR0_RESET          ((Mcu_RawResetType)(0x00000001U))
/* ESR1 reset */
#define MCU_RAW_ESR1_RESET          ((Mcu_RawResetType)(0x00000002U))
/* SMU reset */
#define MCU_RAW_SMU_RESET           ((Mcu_RawResetType)(0x00000008U))
/* Software reset */
#define MCU_RAW_SW_RESET            ((Mcu_RawResetType)(0x00000010U))
/* STM0 Reset*/
#define MCU_RAW_STM0_RESET          ((Mcu_RawResetType)(0x00000020U))
/* STM1 Reset*/
#define MCU_RAW_STM1_RESET          ((Mcu_RawResetType)(0x00000040U))
/* STM2 Reset*/
#define MCU_RAW_STM2_RESET          ((Mcu_RawResetType)(0x00000080U))
/* Power On reset on battery connect*/
#define MCU_RAW_POWER_ON_RESET_1    ((Mcu_RawResetType)(0x13810000U))
/* Power On reset, Pulling down PORST Line */
#define MCU_RAW_POWER_ON_RESET_2    ((Mcu_RawResetType)(0x00010000U))
/*Cerberus System Reset*/
#define MCU_RAW_CB0_RESET           ((Mcu_RawResetType)(0x00040000U))
/*Cerberus Debug Reset*/
#define MCU_RAW_CB1_RESET           ((Mcu_RawResetType)(0x00080000U))
/*Cerberus Application Reset*/
#define MCU_RAW_CB3_RESET           ((Mcu_RawResetType)(0x00100000U))
/* Tuning Protection Reset*/
#define MCU_RAW_TP_RESET            ((Mcu_RawResetType)(0x00200000U))
/* EVR13 Reset*/
#define MCU_RAW_EVR13_RESET         ((Mcu_RawResetType)(0x00810000U))
/* EVR33 Reset*/
#define MCU_RAW_EVR33_RESET         ((Mcu_RawResetType)(0x01010000U))
/* Supply Watchdog Reset*/
#define MCU_RAW_SUPPLY_WDOG_RESET   ((Mcu_RawResetType)(0x02010000U))
/* Standby Regualtor Watchdog Reset*/
#define MCU_RAW_STBYR_RESET         ((Mcu_RawResetType)(0x10010000U))

/* Reset is undefined
   When function Mcu_GetResetReason() is called prior to calling Mcu_Init() */
#define MCU_RAW_RESET_UNDEFINED     ((Mcu_RawResetType)(0xFFFFFFFFU))

/* DPR0 RAR Redundancy data area */
#define MCU_STANDBY_DSPR0_RAR_AREA   (0x70002000U)
#define MCU_STANDBY_DSPR0_RAR_SIZE   (16U) /* in words (32 bit) */


/*******************************************************************************
**                      Global Type Definitions                               **
*******************************************************************************/
  /* [cover parentID=DS_AS40X_MCU232,DS_AS40X_MCU233, DS_AS_Mcu_ClockType] */
  /* Identification for clock setting, which is configured in the
   configuration structure */
typedef uint32   Mcu_ClockType;
  /* [/cover]  */

  /* [cover parentID=DS_AS40X_MCU237,DS_AS_Mcu_ModeType, DS_AS40X_MCU238 ] */
  /* Identification for MCU mode, which is configured in the
   configuration structure */
typedef uint32   Mcu_ModeType;
  /* [/cover]  */

/*[cover parentID=DS_AS_Mcu_RamSectionType, DS_AS40X_MCU240, DS_AS40X_MCU239]*/
/* Identification for a RAM section, which is configured in the
   configuration structure */
typedef uint32   Mcu_RamSectionType;
  /* [/cover]  */

  /* [cover parentID=DS_AS40X_MCU235, DS_AS40X_MCU236,
                      DS_AS_Mcu_RawResetType]  */
  /* This type specifies the reset reason in raw register format
read from a reset status register */
typedef uint32   Mcu_RawResetType;
  /* [/cover]  */

  /* RAM Section base address */
typedef void    *Mcu_RamBaseAdrType;

  /* RAM Section Size */
typedef uint32  Mcu_RamSizeType;

  /* Data Pre-setting to be initialized */
typedef uint8  Mcu_RamPrstDatType;
  /* [/cover]  */


#if (MCU_GET_RAM_STATE_API == STD_ON)
  /* MCUxxx: Structure definition for Ram State  */
    /* [cover parentID=DS_AS40X_Mcu_RamStateType,DS_NAS_PR643_1] */
typedef enum Mcu_RamStateType
{
  MCU_RAMSTATE_INVALID=0x00U, /* Ram content is not valid or unknown */
  MCU_RAMSTATE_VALID=0x01U   /* Ram content is valid */
}Mcu_RamStateType;
/* [/cover] */
#endif /*End of Mcu_GetRamState */

/* [cover parentID=DS_AS_Mcu_PllStatusType, DS_AS40X_MCU231,DS_NAS_PR643_2] */
/* Enumeration for Definitions of Pll status needed for user */
typedef enum Mcu_PllStatusType
{
  MCU_PLL_UNLOCKED,           /* PLL is unlocked */
  MCU_PLL_LOCKED,             /* PLL is locked */
  MCU_PLL_STATUS_UNDEFINED    /* PLL Status is unknown */
}Mcu_PllStatusType;
/* [/cover]  */

/* [cover parentID=DS_AS40X_MCU234,DS_AS_MCU134, DS_AS_Mcu_ResetType] */
/* Reset Status types of MCU needed for user as published in XDM */
typedef enum Mcu_ResetType
{
  MCU_ESR0_RESET=0x00,               /* ESR0 reset */
  MCU_ESR1_RESET=0x01,               /* ESR1 reset */
  MCU_SMU_RESET=0x02,                /* SMU reset */
  MCU_SW_RESET=0x03,                 /* Software reset */
  MCU_STM0_RESET=0x04,               /* STM0 reset */
  MCU_STM1_RESET=0x05,               /* STM1 reset */
  MCU_STM2_RESET=0x06,               /* STM2 reset */
  MCU_POWER_ON_RESET=0x07,           /* Power On reset */
  MCU_CB0_RESET=0x08,                /* CB0 reset */
  MCU_CB1_RESET=0x09,                /* CB1 reset */
  MCU_CB3_RESET=0x0A,                /* CB3 reset */
  MCU_TP_RESET=0x0B,                 /* Tuning Protection reset */
  MCU_EVR13_RESET=0x0C,              /* EVR13 Regualtor Watchdog reset */
  MCU_EVR33_RESET=0x0D,              /* EVR33 Regualtor Watchdog reset */
  MCU_SUPPLY_WDOG_RESET=0x0E,        /* Supply Watchdog reset */
  MCU_STBYR_RESET=0x0F,              /* Standby Regualtor Watchdog reset */
  MCU_RESET_UNDEFINED=0xFFU          /* Reset is undefined */
}Mcu_ResetType;
/* [/cover]  */

  /* MCU031: Clock and Reset Configuration structure */
typedef struct Mcu_ClockCfgType
{
  /*K2DIV : valid values are 0 to 127.
  Even values are preferred to get 50% duty cycle*/
  uint8 K2div[8];
  struct
  {
    unsigned_int K1div:7;             /* Main PLL K1 Divider Value */
    unsigned_int K3div:7;             /* Main PLL K3 Divider Value */
    unsigned_int Ndiv:7;              /* Main PLL N Divider Value */
    unsigned_int Pdiv:4;              /* Main PLL P Divider Value */
    unsigned_int K2steps:4;           /* Main PLL K2 Divider Steps */
    unsigned_int PllMode:1;           /* Main PLL Mode */
    unsigned_int Reserved:2;          /* reserved */
  }Mcu_ClockDivValues;
  struct
  {
    unsigned_int McuErayNDivider:5;   /* Eray PLL N Divider Value */
    unsigned_int McuErayK2Divider:7;  /* Eray PLL K2 Divider Value */
    unsigned_int McuErayK3Divider:7;  /* Eray PLL K3 Divider Value */
    unsigned_int McuErayPDivider:4;   /* Eray PLL P Divider Value */
    unsigned_int Reserved:9;          /* reserved */
  }MCU_ErayPllDivValues;
  uint32 Ccucon0;
  uint32 Ccucon1;
  uint32 Ccucon2;
  uint32 Ccucon5;
  uint32 Ccucon6;
  uint32 Ccucon7;
  uint32 Ccucon8;
  #if (MCU_SAFETY_ENABLE == STD_ON)
  uint32  Ccucon3;
  uint32  Ccucon4;
  uint32  Ccucon9;  
  #endif  
}Mcu_ClockCfgType;
  /* MCU030: Structure definition for RAM settings */
typedef struct Mcu_RamCfgType
{
  Mcu_RamBaseAdrType RamBaseAdrPtr; /* RAM section base address */
  Mcu_RamSizeType RamSize;          /* RAM section size */
  Mcu_RamPrstDatType RamPrstData;   /*Data pre-setting to be initialized */  
}Mcu_RamCfgType;
  
typedef struct Mcu_StandbyModeType
{
  uint32 PMSWCR0;                  /* PMSWCR0 register contents */
  uint8 CrcCheckEnable;            /* CRC check to be done or not */
}Mcu_StandbyModeType;
