keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_MCU_P1/Mcu/Mcu.h
/******************************************************************************
**                      Mcu_Configtype                                        *
*******************************************************************************/

/* MCU022: Structure definition for MCU driver Configuration
Mcu_ConfigType is used to store the configuration data of the MCU Driver

In Post Build Variant the actual configuration is held by the variable
"Mcu_Configuration" defined in Mcu_PBCfg.c. The MCU driver directly refers to
the variable for accessing the configuration. */

/* MCU022: Structure definition for MCU driver Configuration */
/* [cover parentID=DS_AS_MCU131_Mcu_ConfigType] */
typedef struct Mcu_ConfigType
{
  #if (MCU_SAFETY_ENABLE == STD_ON)
  uint32  Marker;
  #endif
  const Mcu_ClockCfgType *ClockCfgPtr;  /* Ptr to Clock Setting Config Struct*/

  #if (MCU_RAM_SECTORS != 0U)
  const Mcu_RamCfgType  *RamCfgPtr;  /* Ptr to RAM Section config structure*/
  #endif /* End For MCU_RAM_SECTORS*/

  #if (MCU_GTM_USED == STD_ON)
  const Gtm_ConfigType     *GtmConfigRootPtr;  /*Ptr to Gtm_ConfigType*/
  #endif /*End for MCU_GTM_USED*/

  uint32 ResetCfg;  /* Reset request configuration */

  Mcu_ClockType NoOfClockCfg;  /* Total number of Clock Settings */

  Mcu_RamSectionType NoOfRamCfg;  /* Total number of RAM Sectors */
  Mcu_ModeType MaxMode;  /* The maximum mode that is supported 
                            by this module instance */
  const Mcu_StandbyModeType *StandbyCfgPtr; /* Ptr to Standby configuration */
}Mcu_ConfigType;
/* [/cover]  */

/*
  Type of power management mode status - Mapped directly to PMST bits of
  SCU_PMCSRx where x is for Core 0,1 or 2
*/
typedef enum
{
  MCU_UNDEFINED_MODE = 0x0U,    /* CPU undefined mode */
  MCU_NORMAL_RUN_MODE = 0x1U,   /* CPU running in normal mode */
  MCU_CPUIDLE_REQ_MODE = 0x2U,  /* CPU Idle mode requested */
  MCU_CPUIDLE_ACK_MODE = 0x3U,  /* CPU Idle mode acknowledged */
  MCU_SLEEP_REQ_MODE = 0x4U,    /* CPU Sleep mode requested */  
  MCU_STANDBY_REQ_MODE = 0x6U,  /* CPU Standby mode requested */    
}Mcu_ModeStateType;

/*******************************************************************************
**                      Global Constant Declarations                          **
*******************************************************************************/
#define MCU_START_SEC_POSTBUILDCFG
#include "MemMap.h"
/* Declaration of Mcu Post Build Configuration */
extern const Mcu_ConfigType Mcu_ConfigRoot[];
#define MCU_STOP_SEC_POSTBUILDCFG
#include "MemMap.h"

/*******************************************************************************
**                      Global Variable Declarations                          **
*******************************************************************************/

/*******************************************************************************
**                      Global Function Declarations                          **
*******************************************************************************/
#define MCU_START_SEC_CODE
#include "MemMap.h"
/*******************************************************************************
** Syntax : void Mcu_Init(const Mcu_ConfigType* ConfigPtr)                    **
**                                                                            **
** Service ID:    0                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non reentrant                                               **
**                                                                            **
** Parameters (in):    ConfigPtr - Pointer to configuration set               **
**                                                                            **
** Parameters (out):   None                                                   **
**                                                                            **
** Return value:       None                                                   **
**                                                                            **
** Description : This routine initializes the MCU driver. The intention of    **
**                 this function is to make the configuration settings for    **
**                 power down, clock and RAM sections visible within the MCU  **
**                 driver.After execution of Mcu_Init() the configuration data**
**                 are accessible and can be used from the Mcu services       **
**                 like Mcu_InitRamSection()                                  **
**                                                                            **
*******************************************************************************/
extern void Mcu_Init(const Mcu_ConfigType* ConfigPtr);

/*******************************************************************************
** Syntax : Std_ReturnType Mcu_InitRamSection                                 **
**           (                                                                **
**              Mcu_RamSectionType    RamSection                              **
**           )                                                                **
**                                                                            **
** Service ID:    1                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non Reentrant                                               **
**                                                                            **
** Parameters (in):    RamSection: Selects RAM memory section provided in     **
**                      configuration set                                     **
**                                                                            **
** Parameters (out):   None                                                   **
**                                                                            **
** Return value:       E_OK: command has been accepted                        **
**                     E_NOT_OK: command has not been accepted                **
**                      e.g. due to parameter error                           **
**                                                                            **
** Description : This function initializes the RAM section wise. The          **
**                 definition of the section and the initialization value is  **
**                 provided from the configuration structure                  **
**                                                                            **
*******************************************************************************/
extern Std_ReturnType Mcu_InitRamSection(Mcu_RamSectionType RamSection );

