keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_MCU_P1/Mcu/Mcu.h
/*******************************************************************************
** Syntax : Std_ReturnType Mcu_InitClock                                      **
**           (                                                                **
**              Mcu_ClockType    ClockSetting                                 **
**           )                                                                **
**                                                                            **
** Service ID:    2                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non Reentrant                                               **
**                                                                            **
** Parameters (in):    ClockSetting: Clock setting                            **
**                                                                            **
** Parameters (out):   None                                                   **
**                                                                            **
** Return value:       E_OK: command has been accepted                        **
**                     E_NOT_OK: command has not been accepted                **
**                      e.g. due to parameter error                           **
**                                                                            **
** Description : This function initializes the PLL and other MCU specific     **
**                 clock options. The clock configuration parameters are      **
**                 provided via the configuration structure. In this function **
**                 the PLL lock procedure is started (if PLL shall be         **
**                 initialized) but the function does not wait until the PLL  **
**                 is locked                                                  **
**               Note: Mcu_InitClock only initializes the PLL parameters.     **
**                 PLL clock will be activated to the MCU distribution only   **
**                 after the PLL is locked and then Mcu_DistributePllClock is **
**                 called. i.e The sequence to activate PLL clock to the MCU  **
**                  clock distribution is                                     **
**                  1)Call Mcu_InitClock                                      **
**                  2)Call Mcu_GetPllStatus                                   **
**                  3)Mcu_DistributePllClock                                  **
**                                                                            **
*******************************************************************************/
#if (MCU_INIT_CLOCK == STD_ON)
extern Std_ReturnType Mcu_InitClock(Mcu_ClockType ClockSetting );
#else
#define Mcu_InitClock(ClockSetting)  ERROR_Mcu_InitClock_NOT_SELECTED
#endif
/* End of (MCU_INIT_CLOCK == STD_ON)*/

/*******************************************************************************
** Syntax : void Mcu_DistributePllClock( void )                               **
**                                                                            **
** Service ID:    3                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non Reentrant                                               **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      None                                                    **
**                                                                            **
** Description : This function activates the PLL clock to the MCU clock       **
**               distribution. This function shall be executed, if the MCU    **
**               needs a separate request to activate the PLL clock after the **
**               PLL is locked. In this case the current clock source         **
**               (for example internal oscillator clock) is removed from MCU  **
**               clock distribution.                                          **
**                                                                            **
*******************************************************************************/
extern void Mcu_DistributePllClock( void );

/******************************************************************************
** Syntax : Mcu_PllStatusType Mcu_GetPllStatus( void )                        **
**                                                                            **
** Service ID:    4                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Reentrant                                                   **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:   Mcu_PllStatusType                                          **
**                 Returns whether PLL is Locked,Unlocked or Undefined status **
**                                                                            **
** Description : This function provides the lock status of the PLL            **
**                                                                            **
*******************************************************************************/
extern Mcu_PllStatusType Mcu_GetPllStatus( void );

