keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_MCU_P1/Mcu/Mcu.h
/******************************************************************************
** Syntax : Mcu_ResetType Mcu_GetResetReason( void )                          **
**                                                                            **
** Service ID:    5                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Reentrant                                                   **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      Mcu_ResetType                                           **
**                    Returns the reset reason                                **
**                                                                            **
** Description : The function reads the reset type from the hardware, if      **
**               supported. If the hardware doesn't support the hardware      **
**               detection of the reset reason, the return value for those    **
**               resets is always MCU_POWER_ON_RESET.                         **
**                                                                            **
*******************************************************************************/
extern Mcu_ResetType Mcu_GetResetReason( void );

/******************************************************************************
** Syntax : Mcu_ResetType Mcu_GetResetRawValue( void )                        **
**                                                                            **
** Service ID:    6                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Reentrant                                                   **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      Mcu_RawResetType                                        **
**                    Returns the reset reason                                **
**                                                                            **
** Description : The function reads the reset type from the hardware, if      **
**               supported. If the hardware doesn't have reset status register**
**               return value shall be 0x0.                                   **
**                                                                            **
*******************************************************************************/
extern Mcu_RawResetType  Mcu_GetResetRawValue( void );

/* MCU108, MCU007  : This function is available if the runtime parameter
   MCU_PERFORM_RESET_API is set to TRUE. */
#if (MCU_PERFORM_RESET_API == STD_ON)
/******************************************************************************
** Syntax : void Mcu_PerformReset( void )                                     **
**                                                                            **
** Service ID:    7                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non reentrant                                               **
**                                                                            **
** Parameters (in):   None                                                    **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      None                                                    **
**                                                                            **
** Description :The function performs a microcontroller reset. This           **
**              is done by using the hardware feature of the microcontroller. **
**              The MCU specific reset type to be performed by this service   **
**              shall be configured in the configuration set.                 **
**                                                                            **
*******************************************************************************/
extern void Mcu_PerformReset( void );
#endif /* End of MCU_PERFORM_RESET_API */

/******************************************************************************
** Syntax : void Mcu_SetMode                                                  **
**          (                                                                 **
**                Mcu_ModeType   McuMode                                      **
**           )                                                                **
**                                                                            **
** Service ID:    8                                                           **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non reentrant                                               **
**                                                                            **
** Parameters (in):   McuMode : Set different MCU power modes configured in   **
**                     the configuration set                                  **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      None                                                    **
**                                                                            **
** Description :This function activates the MCU power modes. In case the      **
**              CPU is switched off, the function is returned after a         **
**              wake-up was performed                                         **
**                                                                            **
*******************************************************************************/
extern void Mcu_SetMode(Mcu_ModeType McuMode);

