keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_MCU_P1/Mcu/Mcu.h
#if (MCU_INITCHECK_API == STD_ON)
/*******************************************************************************
**                                                                            **
** Syntax          : void Mcu_InitCheck (const Mcu_ConfigType* ConfigPtr)     **
**                                                                            **
** Service ID      :    None                                                  **
**                                                                            **
** Sync/Async      :    Synchronous                                           **
**                                                                            **
** Reentrancy      :    Non Reentrant                                         **
**                                                                            **
** Parameters (in) :    ConfigPtr - Pointer to MCU Driver configuration set   **
**                                                                            **
** Parameters (out):    None                                                  **
**                                                                            **
** Return value    :    None                                                  **
**                                                                            **
** Description     : This routine verifies the initialization the MCU driver. **
**                   Note: The sequence should be                             **
**                    1)Call Mcu_InitClock                                    **
**                    2)Call Mcu_GetPllStatus                                 **
**                    3)Call Mcu_DistributePllClock                           **
**                    4)Call Mcu_InitCheck                                    **
**                                                                            **
*******************************************************************************/
extern Std_ReturnType Mcu_InitCheck (const Mcu_ConfigType* ConfigPtr);

#endif /* (MCU_INIT_CHECK_API == STD_ON) */

#if (MCU_GETMODE_API == STD_ON)
/*******************************************************************************
** Syntax           : Mcu_ModeStateType  Mcu_GetMode                          **
**                    (                                                       **
**                      void                                                  **
**                    )                                                       **
**                                                                            **
** Service ID       : None                                                    **
**                                                                            **
** Sync/Async       : Synchronous                                             **
**                                                                            **
** Reentrancy       : Non reentrant                                           **
**                                                                            **
** Parameters (in):   CoreId : The Core for which the mode needs to be        **
**                    dertermined                                             **
**                                                                            **
** Parameters (out) : None                                                    **
**                                                                            **
** Return value     : Mcu_ModeStateType  - Power mode status                  **
**                                                                            **
** Description      :                                                         **
**   - provides the mode the CPU is currently in                              **
**                                                                            **
*******************************************************************************/
extern Mcu_ModeStateType Mcu_GetMode( uint8 CoreId );
#endif /* (MCU_GETMODE_API == STD_ON) */

#define MCU_STOP_SEC_SAFETY_CODE
#include "MemMap.h"

#endif  /*End of MCU_SAFETY_ENABLE */

/*******************************************************************************
**                      Global Inline Function Definitions                    **
*******************************************************************************/

/* MCU108, MCU104 : This service is only available if
   the preprocessor switch MCU_VERSION_INFO_API is set to TRUE*/
/*******************************************************************************
** Traceability : [cover parentID=DS_AS_MCU101, DS_AS_MCU103,DS_AS_MCU204,
                   DS_AS_MCU162, DS_AS_MCU149]                               **
** Syntax     : void Mcu_GetVersionInfo( Std_VersionInfoType *VersionInfoPtr) **
**                                                                            **
** [/cover]                                                                   **
**                                                                            **
** Service ID   : 9                                                           **
**                                                                            **
** Sync/Async   : Synchronous                                                 **
**                                                                            **
** Reentrancy   : Non-reentrant                                               **
**                                                                            **
** Parameters (in) : None                                                     **
**                                                                            **
** Parameters (out): VersionInfoPtr (Pointer to store the version             **
**                   information of this module)                              **
**                                                                            **
** Return value : None                                                        **
**                                                                            **
** Description  : This service returns the version information of this module.**
**               The version information includes:                            **
**               - Module Id                                                  **
**               - Vendor Id                                                  **
**               - Instance Id (Applicable only for MCU SWS 2.2.0)            **
**               - Vendor specific version numbers (BSW00407)                 **
**                                                                            **
*******************************************************************************/
#if ((MCU_VERSION_INFO_API == STD_ON) && (MCU_DEV_ERROR_DETECT == STD_ON))
#define Mcu_GetVersionInfo(VersionInfoPtr)                                   \
{                                                                         \
  if (VersionInfoPtr == NULL_PTR)                                            \
  {                                                                       \
    /* Report to DET */                                                   \
    Det_ReportError(                                                      \
                     (uint16)MCU_MODULE_ID,                               \
                     MCU_MODULE_INSTANCE,                                 \
                     MCU_SID_GETVERSIONINFO,                              \
                     MCU_E_PARAM_POINTER                                  \
                   );                                                     \
  }                                                                       \
  else                                                                    \
  {                                                                       \
    /* MCU Module ID */                                                   \
    ((Std_VersionInfoType*)(VersionInfoPtr))->moduleID = MCU_MODULE_ID;   \
    /* MCU vendor ID */                                                   \
    ((Std_VersionInfoType*)(VersionInfoPtr))->vendorID = MCU_VENDOR_ID;   \
    /* major version of MCU */                                            \
    ((Std_VersionInfoType*)(VersionInfoPtr))->sw_major_version =          \
                                    (uint8)MCU_SW_MAJOR_VERSION;          \
    /* minor version of MCU */                                            \
    ((Std_VersionInfoType*)(VersionInfoPtr))->sw_minor_version =          \
                                    (uint8)MCU_SW_MINOR_VERSION;          \
    /* patch version of MCU */                                            \
    ((Std_VersionInfoType*)(VersionInfoPtr))->sw_patch_version =          \
                                    (uint8)MCU_SW_PATCH_VERSION;          \
  }                                                                       \
}
#elif ((MCU_VERSION_INFO_API == STD_ON) && (MCU_DEV_ERROR_DETECT == STD_OFF))
#define Mcu_GetVersionInfo(VersionInfoPtr)                                \
{                                                                         \
  /* MCU Module ID */                                                     \
  ((Std_VersionInfoType*)(VersionInfoPtr))->moduleID = MCU_MODULE_ID;     \
  /* MCU vendor ID */                                                     \
  ((Std_VersionInfoType*)(VersionInfoPtr))->vendorID = MCU_VENDOR_ID;     \
  /* major version of MCU */                                              \
  ((Std_VersionInfoType*)(VersionInfoPtr))->sw_major_version =            \
                                  (uint8)MCU_SW_MAJOR_VERSION;            \
  /* minor version of MCU */                                              \
  ((Std_VersionInfoType*)(VersionInfoPtr))->sw_minor_version =            \
                                  (uint8)MCU_SW_MINOR_VERSION;            \
  /* patch version of MCU */                                              \
  ((Std_VersionInfoType*)(VersionInfoPtr))->sw_patch_version =            \
                                  (uint8)MCU_SW_PATCH_VERSION;            \
}
#else
#define Mcu_GetVersionInfo(VersionInfo) ERROR_Mcu_GetVersionInfo_NOT_SELECTED
#endif

