keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_MCU_P1/Mcu/Mcu.h
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_MCUPR2878]                           **
** Syntax : _IFXEXTERN_ _INLINE_ uint32 Mcu_ChkWkpStdby(void)                 **
** [/cover]                                                                   **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  non reentrant                                                 **
**                                                                            **
** Parameters (in): none                                                      **
**                                                                            **
** Parameters (out):  none                                                    **
**                                                                            **
** Return value:  Status bits of PMSWSTAT register                            **
**                                                                            **
** Description : Function to return status bits of Wakeup bits                **
**                                                                            **
*******************************************************************************/
_IFXEXTERN_ _INLINE_ uint32 Mcu_ChkWkpStdby(void)
{
  return (SCU_PMSWSTAT.U);
}

/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_MCUPR2879]                           **
** Syntax : _IFXEXTERN_ _INLINE_ void Mcu_ClrWkpStdby(uint32 WkpBits)         **
** [/cover]                                                                   **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  non reentrant                                                 **
**                                                                            **
** Parameters (in): WkpBits - Bits to be cleared                              **
**                                                                            **
** Parameters (out):  none                                                    **
**                                                                            **
** Return value:  none                                                        **
**                                                                            **
** Description : Function to clear status bits of Wakeup pins                 **
**                                                                            **
*******************************************************************************/
_IFXEXTERN_ _INLINE_ void Mcu_ClrWkpStdby(uint32 WkpBits)
{
  #if (MCU_SAFETY_ENABLE == STD_OFF)
  Mcal_ResetSafetyENDINIT_Timed(MCU_SAFETY_ENDINT_TIMEOUT);
  #endif
  
  SCU_PMSWSTATCLR.U = WkpBits;
  
  #if (MCU_SAFETY_ENABLE == STD_OFF)
  Mcal_SetSafetyENDINIT_Timed();
  #endif
}

#if (MCU_SET_STANDBY_CONTROL_API == STD_ON)
/*******************************************************************************
** Traceability : [cover parentID=DS_NAS_MCUPR2881]                           **
**                                                                            **
** Syntax : _IFXEXTERN_ _INLINE_ void Mcu_SetStandbyCtrlReg                   **
**          (                                                                 **
**             uint32   PMSWCR0_RegVal                                        **
**          )                                                                 **
** [/cover]                                                                   **
**                                                                            **
** Service ID:    NA                                                          **
**                                                                            **
** Sync/Async:    Synchronous                                                 **
**                                                                            **
** Reentrancy:    Non reentrant                                               **
**                                                                            **
** Parameters (in):   PMSWCR0_RegVal : PMSWCR0 register value                 **
**                    the configuration set                                   **
**                                                                            **
** Parameters (out):  None                                                    **
**                                                                            **
** Return value:      None                                                    **
**                                                                            **
** Description : This function updates PMSWCR0 during runtime for standby mode**
**                                                                            **
*******************************************************************************/
_IFXEXTERN_ _INLINE_ void Mcu_SetStandbyCtrlReg(uint32 PMSWCR0_RegVal)
{
  #if (MCU_SAFETY_ENABLE == STD_OFF)
  Mcal_ResetSafetyENDINIT_Timed(MCU_SAFETY_ENDINT_TIMEOUT);
  #endif
  
  MODULE_SCU.PMSWCR0.U = PMSWCR0_RegVal;

  #if (MCU_SAFETY_ENABLE == STD_OFF)
  Mcal_SetSafetyENDINIT_Timed();
  #endif
}/*End of Mcu_SetStandbyCtrlReg()*/
#endif /* (MCU_SET_STANDBY_CONTROL_API == STD_ON) */

#endif  /* End of  MCU_H */
